<?php

return [
    'common' => [
        'back'         => '< Назад',
        'support'      => 'Написать в поддержку',
        'add_question' => 'Добавить тест',
        'feedback'     => 'Сообщить о проблеме/улучшении',
        'menu'         => '❌ Отменить',
    ],

    'main' => [
        'wallet'    => '💸 Кошелек',
        'market'    => '🛍 Маркет тестов',
        'referrals' => '👥 Рефералы',
        'settings'  => '⚙️ Настройки',
    ],

    'wallet' => [
        'top_up'   => '➕ Пополнить',
        'withdraw' => '➡️ Вывести',
        'pay_url'  => 'Разместить реф. ссылку монобанк - :price UAH',
    ],

    'settings' => [
        'set' => [
            'login'    => 'Задать логин',
            'password' => 'Задать пароль',
        ],
        'update' => [
            'login'    => 'Изменить логин',
            'password' => 'Изменить пароль',
        ],
    ],

    'questions' => [
        'type' => [
            'mass'   => 'Массовое прохождение',
            'single' => 'Ручной выбор',
        ],

        'action' => [
            'all'             => 'Все тесты (-:discount%)',
            'module'          => ':num модуль (-:discount%)',
            'module_not_lab'  => ':num - лекции (-:discount%)',
            'module_with_lab' => ':num - лаб. (-:discount%)',
        ],
    ],

    'order' => [
        'pay' => '💵 Оплатить',
    ],
];
